artifacts/cfd-smoke/final-verification/negative/solver_failure/constant/physicalProperties
FoamFile
{
 version 2.0; format ascii; class dictionary; location "constant"; object physicalProperties;
}
viscosityModel constant; nu [0 2 -1 0 0 0 0] 1e-6;
